movie-rent-api/app/controllers/films_controller.rb

INSERT INTO "films" ("title", "description", "year", "rental_duration", "rating", "duration", "rental_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @film = Film.new(film_params)

    if @film.save